In [1]:
import pandas as pd
import numpy as np

In [5]:
# Create data with a missing value
stuff = {'A':[1,2,3], 'B':[4,np.nan,6], 'C':[7,8,9], 'D':[10,11,12]}
my_df = pd.DataFrame(stuff)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [7]:
# Drop rows with any null values (Default is axis=0)
my_df.dropna()

   A    B  C   D
0  1  4.0  7  10
2  3  6.0  9  12

In [8]:
# Drop columns with any null values
my_df.dropna(axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [9]:
# Not permanent, implace = false
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [11]:
# with more than 1 null value
stuff = {'A':[1,2,3], 'B':[4,np.nan,np.nan], 'C':[7,8,9], 'D':[10,11,12]}
my_df2 = pd.DataFrame(stuff)
my_df2

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  NaN  9  12

In [20]:
# Set a threshold (Keep rows/columns with at least 1 non-null values)
my_df2.dropna(thresh=1, axis=1)

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  NaN  9  12

In [18]:
# Set a threshold (Keep rows/columns with at least 2 non-null values)
my_df2.dropna(thresh=2, axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [72]:
# Fill null values with a specific word or number
my_df2.fillna(value=5, inplace=True)

   A    B  C   D
0  1  4.0  7  10
1  2  5.0  8  11
2  3  5.0  9  12